ShellAlbert/DroneCatcher/STM32/DroneCatcher/Core/Src/main.c
  /*Configure GPIO pins : MOTOR1_SD_Pin LED3_Pin */
  GPIO_InitStruct.Pin = MOTOR1_SD_Pin|LED3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pin : LED4_Pin */
  GPIO_InitStruct.Pin = LED4_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED4_GPIO_Port, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void uartCmdParse(uint8_t *cmd,uint8_t cmdLen)
{
	//return directly to verify if received successfully.
	HAL_UART_Transmit(&huart1,cmd,cmdLen,200);
	//Sync1 Sync2  Command   DataLen      Data           CRC32
	//5A     A5      01        01      XX XX XX XX     XX XX XX XX
	//Command:01,motor rotate control.
	//Data:00 00 00 01,move clockwise.
	//Data:00 00 00 02,move anti-clockwise.
	if(cmdLen<12)
	{
		return;
	}else if(cmd[0]!=0x5A || cmd[1]!=0xA5)
	{
		return;
	}
	switch(cmd[2])
	{
	case 0x01:
		if(cmd[3]==0x01 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 &&cmd[7]==0x01)
		{
			//GetBack.
			//top arm driven with pwm.
			__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,2);// CCR/ARR=2/4=50%.
			//bottom arm driven with 0,always on.
			__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,0);// CCR/ARR=0/4=0%.
			//ShutDown: enable(1),disable(0).
			HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);
			HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
			HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2);
			//start timer17 to timeout to stop pwm.
			HAL_TIM_Base_Start_IT(&htim17);
		}else if(cmd[3]==0x01 && cmd[4]==0x00 && cmd[5]==0x00 && cmd[6]==0x00 &&cmd[7]==0x02)
		{
			//ThrowOut.
			__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,0);// CCR/ARR=0/4=0%.
			__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,2);// CCR/ARR=2/4=50%.
			//ShutDown: enable(1),disable(0).
			HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);
			HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
			HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2);
			//start timer17 to timeout to stop pwm.
			HAL_TIM_Base_Start_IT(&htim17);
		}
	default:
		break;
	}
}
/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
 * @brief  Function implementing the defaultTask thread.
 * @param  argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
	/* Infinite loop */
	for(;;)
	{
		osDelay(500);
		HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET);
		osDelay(500);
		HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
	}
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_commTaskEntry */
/**
 * @brief Function implementing the commTask thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_commTaskEntry */
void commTaskEntry(void *argument)
{
  /* USER CODE BEGIN commTaskEntry */
	//GetBack.
	//__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,2);// CCR/ARR=2/4=50%.
	//__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,0);// CCR/ARR=0/4=0%.
	//ThrowOut.
//	__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_1,0);// CCR/ARR=0/4=0%.
//	__HAL_TIM_SET_COMPARE(&htim1,TIM_CHANNEL_2,2);// CCR/ARR=2/4=50%.
	//ShutDown: enable(0),disable(1).
//	HAL_GPIO_WritePin(GPIOG, MOTOR1_SD_Pin, GPIO_PIN_SET);
//	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);
//	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_2);
	HAL_TIM_Encoder_Start(&htim3,TIM_CHANNEL_1);
	HAL_TIM_Encoder_Start(&htim3,TIM_CHANNEL_2);
	/* Infinite loop */
	for(;;)
	{
		uint16_t iEncoder;
		uint8_t iBuffer[64];
		uint32_t iCrc32;
		osDelay(10);
		if(uartRxFinished)
		{
			HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);
			//parse received command.
			uartCmdParse(uartRxBuffer,uartRxLen);
			//reset rx buffer.
			memset(uartRxBuffer,0,sizeof(uartRxBuffer));
			//reset flag.
			uartRxLen=0;
			uartRxFinished=0;
			HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
		}
		HAL_UART_Receive_DMA(&huart1,uartRxBuffer,64);

		//read encoder value and tx out.
		//iEncoder=__HAL_TIM_GET_COUNTER(&htim3);
		//sprintf((char*)iBuffer,"%d\r\n",iEncoder);
		//HAL_UART_Transmit(&huart1,iBuffer,strlen((char*)iBuffer),200);
//		iBuffer[0]=0x5a;
//		iBuffer[1]=0xa5;
//		iBuffer[2]=0x01;
//		iBuffer[3]=0x02;
//		iBuffer[4]=0x03;
//		iBuffer[5]=0x04;
//		iBuffer[6]=0x05;
//		iBuffer[7]=0x06;
//		iCrc32=HAL_CRC_Calculate(&hcrc,(uint32_t*)iBuffer,2);
//		sprintf((char*)iBuffer,"crc32=%x\r\n",(unsigned int)iCrc32);
//		HAL_UART_Transmit(&huart1,iBuffer,strlen((char*)iBuffer),200);
	}
  /* USER CODE END commTaskEntry */
}

 /**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM5 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM5) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1)
	{
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
